# устанавливаем официальный образ Node.js
FROM node:20-alpine

# указываем рабочую (корневую) директорию
WORKDIR /app

# пока копируем с зависимостями, в них есть правки и они заблочены в рф

# копируем основные файлы приложения в рабочую директорию
# COPY package.json package-lock.json ./

# устанавливаем указанные зависимости NPM на этапе установки образа
# RUN npm install

# после установки копируем все файлы проекта в корневую директорию
COPY . ./

# запускаем основной скрипт в момент запуска контейнера
CMD npm start
